app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (filter_name) AND (filter_status)
SELECT "products".* FROM "products" WHERE (name like '%table%') AND "products"."price" = ?  [["price", "500"]]
SELECT "products".* FROM "products" WHERE (name like '%a%') AND "products"."price" = ? AND (image like '%png%') AND "products"."status" = ?  [["price", "400"], ["status", "Disabled"]]
---
  def index
    if !params[:filter_name].present? && !params[:filter_price].present? && !params[:filter_image].present? && !params[:filter_status].present?
      @products = Product.all
    else
      @products = Product.where(nil)
      @products = @products.pname(params[:filter_name]) if params[:filter_name].present?
      @products = @products.pprice(params[:filter_price]) if params[:filter_price].present?
      @products = @products.pimage(params[:filter_image]) if params[:filter_image].present?
      @products = @products.pstatus(params[:filter_status]) if params[:filter_status].present?

INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "table"], ["description", "this is wooden table"], ["image", "10.jpg"], ["price", 2000.0], ["created_at", "2015-07-16 13:11:53.557649"], ["updated_at", "2015-07-16 13:11:53.557649"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "5.jpg"], ["updated_at", "2015-07-16 17:39:04.151537"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 22]]
---
  def destroy
    Product.destroy(dell_cats)

SELECT  "products".* FROM "products" WHERE "products"."id" IN (1, 2, 3, 7, 8, 9) LIMIT 1
---
  def set_product
    @product = Product.find(params[:id])